In [128]:
import pandas as pd
import numpy as np

In [129]:
df = pd.read_csv("IRIS.csv")
print(df)

     sepal_length  sepal_width  petal_length  petal_width         species
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 5 columns]

In [130]:
# The question Number 1 (A)

df[:11]
df.shape
df.describe()

# -- To get the min of all the data except the str coloum

for minn in df:
    min_sepal = df[minn].min()
    print(f"Min of the {minn} is {min_sepal}")


#And for the single mean std min and max for every coloum is below 

mean_sepal = df['sepal_length'].mean()
print(mean_sepal)

# # same for all coloum 
std_sepal = df['sepal_length'].std()
print(std_sepal)

# # same for all the coloum
min_sepal = df['sepal_length'].min()
print(min_sepal)

# # same for all the coloum
max_sepal = df['sepal_length'].max()
print(max_sepal)

# part (B) ----

# sepal length > 4.5 

new_sepal = df[df['sepal_length'] > 4.5]
print(new_sepal)

# part (C) ---

print(df['species'].unique())

setosa = df[df['species'] == "Iris-setosa"]
avg_setosa = setosa['sepal_length'].mean()
print(avg_setosa)  # that's how you can get the avg of setosa

versicolor = df[df['species'] == 'Iris-versicolor']
avg_versicolor = versicolor['sepal_length'].mean()
print(avg_versicolor)  # This is a avg of the Iris-versicolor

virginica = df[df['species'] == 'Iris-virginica']
avg_virginica = virginica['sepal_length'].mean()
print(avg_virginica)

Min of the sepal_length is 4.3
Min of the sepal_width is 2.0
Min of the petal_length is 1.0
Min of the petal_width is 0.1
Min of the species is Iris-setosa
5.843333333333334
0.8280661279778629
4.3
7.9
     sepal_length  sepal_width  petal_length  petal_width         species
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[145 rows x 5 columns]
['Iris-setosa' 'Iris-versicolor' 'Iris-virginica']
5.006
5.936
6.587999999999998

In [131]:
print(avg_setosa)

5.006

In [132]:
df2 = df['petal_ratio'] = (df['sepal_length']/ df['sepal_width'])

In [133]:
df

,sepal_length,sepal_width,petal_length,petal_width,species,petal_ratio
0,5.1,3.5,1.4,0.2,Iris-setosa,1.457143
1,4.9,3.0,1.4,0.2,Iris-setosa,1.633333
2,4.7,3.2,1.3,0.2,Iris-setosa,1.468750
3,4.6,3.1,1.5,0.2,Iris-setosa,1.483871
4,5.0,3.6,1.4,0.2,Iris-setosa,1.388889
...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,Iris-virginica,2.233333
146,6.3,2.5,5.0,1.9,Iris-virginica,2.520000
147,6.5,3.0,5.2,2.0,Iris-virginica,2.166667
148,6.2,3.4,5.4,2.3,Iris-virginica,1.823529
149,5.9,3.0,5.1,1.8,Iris-virginica,1.966667

In [134]:
df['species'].unique()

array(['Iris-setosa', 'Iris-versicolor', 'Iris-virginica'], dtype=object)

In [135]:
# To get the average of all the species in the data

setosa_data = df[df['species'] == "iris-setosa" ] # select that specific coloum in data 
setosa_ratio = df['petal_ratio'].mean()  # after that now we can get the mean()
print(f"Average of the iris setosa is {setosa_ratio}")

versicolor_data = df[df['species'] == "iris_setosa"]
versicolor_ratio = df['petal_ratio'].mean()
print(f"Average of the iris versicolor is {versicolor_ratio}")

virginica_data = df[df['species'] == "virginica"]
verginica_ratio = df['petal_ratio'].mean()
print(f"Average of the iris verginica is {verginica_ratio}")

Average of the iris setosa is 1.955144430869462
Average of the iris versicolor is 1.955144430869462
Average of the iris verginica is 1.955144430869462

In [136]:
# Load New data that was Titanic dataset 
tds2 = pd.read_csv("Titanic-Dataset.csv")

In [137]:
tds2.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [138]:
# Display the coloums like name, sex, age, fare, survived

tds = tds[['Name', 'Sex', 'Age', 'Fare', 'Survived']]

In [139]:
tds

,Name,Sex,Age,Fare,Survived
0,"Braund, Mr. Owen Harris",male,22.0,7.2500,0
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,1
2,"Heikkinen, Miss. Laina",female,26.0,7.9250,1
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,1
4,"Allen, Mr. William Henry",male,35.0,8.0500,0
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,27.0,13.0000,0
887,"Graham, Miss. Margaret Edith",female,19.0,30.0000,1
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,23.4500,0
889,"Behr, Mr. Karl Howell",male,26.0,30.0000,1
890,"Dooley, Mr. Patrick",male,32.0,7.7500,0

In [140]:
# Q2 B) Select Passanger female, fare>30

female_pas = tds[tds['Sex'] == "female"]
print(female_pas)

                                                  Name     Sex   Age     Fare  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0  71.2833
2                               Heikkinen, Miss. Laina  female  26.0   7.9250
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0  53.1000
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0  11.1333
9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0  30.0708
..                                                 ...     ...   ...      ...
880       Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0  26.0000
882                       Dahlberg, Miss. Gerda Ulrika  female  22.0  10.5167
885               Rice, Mrs. William (Margaret Norton)  female  39.0  29.1250
887                       Graham, Miss. Margaret Edith  female  19.0  30.0000
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN  23.4500

     Survived
1           1
2           1
3           1
8           1
9           1
..        ...
880         1
882         0
885         0
887         1
888         0

[314 rows x 5 columns]

In [141]:
# where fare > 30

more_fare = tds[tds['Fare'] > 30]
print(more_fare)

                                                  Name     Sex   Age  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
6                              McCarthy, Mr. Timothy J    male  54.0
9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0
13                         Andersson, Mr. Anders Johan    male  39.0
..                                                 ...     ...   ...
856         Wick, Mrs. George Dennick (Mary Hitchcock)  female  45.0
863                  Sage, Miss. Dorothy Edith "Dolly"  female   NaN
867               Roebling, Mr. Washington Augustus II    male  31.0
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female  47.0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0

         Fare  Survived
1     71.2833         1
3     53.1000         1
6     51.8625         0
9     30.0708         1
13    31.2750         0
..        ...       ...
856  164.8667         1
863   69.5500         0
867   50.4958         0
871   52.5542         1
879   83.1583         1

[234 rows x 5 columns]

In [192]:
# Q2 C) Group by pclass and compute: 
# - survivel rate
# - average fare
# - average age

def survivel_rate(tds):

    survive = 0
    expire = 0
    for pas in tds['Survived']:
        if pas == 1:
            survive += 1

        else:
            expire += 1
            
    rate_of_sur = round((survive/(survive + expire)) * 100, 2)
    
    print(f"Rate of the Survivel in Percentage is {rate_of_sur}%")

In [194]:
survivel_rate(tds)

Rate of the Survivel in Percentage is 38.38%

In [198]:
avg_fare = tds['Fare'].mean()
print(f"Average Fare is {avg_fare}")

Average Fare is 32.204207968574636

In [200]:
avg_age = tds['Age'].mean()
print(f"Average Age is {avg_age}")

Average Age is 29.69911764705882